package lesson6.task1;

public class Regex {
    public static void main(String[] args) {
        String input = "2020/12/14 08:30";
        String regex = "^\\d{4}/(0[1-9]|1[0-2])/(0[1-9]|[12][0-9]|3[?])\s(0[1-9]|1[0-9]|2[0-3]):([0-5][0-9])$";
        /*
         ^\d{4}\/ - начинается с любой цифры 4 повторения - YYYY, потом разделение знаком /
         (0[1-9]|1[0-2])\\/ - группа для месяца. Если начинается с 0, то от 1 до 9,
         если с 1 то до 2.
         3[?] - или 30, или 31 день
         \s - пробел\
         */
        System.out.println(input.matches(regex));
    }
}
